import { ResetDatabase } from '@/sql';

export default `${ResetDatabase}

use mini_bookkeeping;

insert into departments(Id, \`Name\`) values 
(1, 'Юристы'),
(2, 'Киберспортсмены'),
(3, 'Программисты');

insert into employees(Id, FullName, DepartmentId) values
(1, 'Николаева София Матвеевна', 1),
(2, 'Мальцев Владимир Маркович', 2),
(3, 'Новиков Сергей Артёмович', 3),
(4, 'Анисимов Михаил Алексеевич', 1),
(5, 'Баранов Даниил Никитич', 2),
(6, 'Яковлев Николай Георгиевич', 3),
(7, 'Фомина Василиса Максимовна', 1),
(8, 'Голикова Дарья Степановна', 2),
(9, 'Федоров Виктор Егорович', 3),
(10, 'Хохлов Денис Михайлович', 1);

insert into shops(Id, \`Name\`) values
(1, 'АТБ'),
(2, 'Розетка'),
(3, 'Варус'),
(4, 'Макдональдс');

insert into types_of_costs(Id, \`Name\`, \`Description\`, ThresholdPerMonth) values
(1, 'Техника', 'Покупка различных гаджетов', 100000),
(2, 'Еда', 'Покупка еды в оффис', 30000),
(3, 'Для оффиса', 'Различиные услуги', 60000);

insert into expenses(Id, \`Description\`, Price, DateOfPurchase, DepartmentId, EmployeeId, TypeOfCostId, ShopId) values
(1, 'Игровая мышь', 2500, '2021-01-03', 2, 1, 1, 2),
(2, 'Печенье в оффис', 400, '2021-01-14', 1, 2, 2, 1),
(3, 'Лазерный принтер', 5430, '2021-01-28', 2, 3, 1, 2),
(4, '10л колы', 128, '2021-01-03', 3, 4, 2, 2),
(5, 'Средство для мытья пола', 305, '2021-02-01', 1, 5, 3, 3),
(6, '5 пачек бумаги', 450, '2021-01-06', 2, 6, 3, 3),
(7, 'Игровой монитор', 34099, '2021-01-07', 2, 1, 3, 2),
(8, 'Доставка еда на корпоратив', 13000, '2021-01-09', 1, 2, 1, 4),
(9, 'Набор упаковок чая', 3453, '2021-01-11', 3, 3, 2, 1),
(10, 'Пицца', 2500, '2021-01-03', 3, 4, 2, 4);`;
